app/controllers/snippets_controller.rb

  def index
    @snippets = Snippet.paginate(:all,:order => 'title ASC', :per_page => 20, :page => params[:page])
---
SELECT "snippets".id FROM "snippets" WHERE ("snippets"."title" = 'Prueba de C++' AND "snippets".id <> 1) LIMIT 1
SELECT count(*) AS count_all FROM "snippets" WHERE (lenguaje = 1)

  def show
    @snippet = Snippet.find(params[:id])
---
SELECT * FROM "snippets" WHERE ("snippets"."id" = 1)

  def lenguaje
    @snippets = Snippet.find(:all,:conditions => ["lenguaje = ?",params[:id]])
---
SELECT * FROM "snippets" WHERE (lenguaje = NULL)

  def edit
    @snippet = Snippet.find(params[:id])
---
SELECT * FROM "snippets" WHERE ("snippets"."id" = 2)

  def create
    @snippet = Snippet.new(params[:snippet])
    respond_to do |format|
      if @snippet.save
---
INSERT INTO "snippets" ("created_at", "title", "updated_at", "descripcion", "id_user", "codigo", "tags", "lenguaje") VALUES('2011-04-18 14:12:48', 'asfasf', '2011-04-18 14:12:48', 'asfasf', 1, 'gboolean StreamThread::bus_message(GstBus *bus, GstMessage *message, gpointer user_data){

  def update
    @snippet = Snippet.find(params[:id])

    respond_to do |format|
      if @snippet.update_attributes(params[:snippet])
---
SELECT * FROM "snippets" WHERE ("snippets"."id" = 2)
UPDATE "snippets" SET "updated_at" = '2011-04-19 20:19:08', "tags" = 'Prueba, C++, Test' WHERE "id" = 2

  def destroy
    @snippet = Snippet.find(params[:id])
---
SELECT * FROM "snippets" WHERE ("snippets"."id" = 980190962)